app/controllers/messages_controller.rb

INSERT INTO "messages" ("message_body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["message_body", "hyyyy wassup"], ["user_id", 1], ["created_at", "2021-08-16 07:12:02.568602"], ["updated_at", "2021-08-16 07:12:02.568602"]]
---
  def create
    message = current_user.messages.build(message_params)
    if message.save